app/controllers/contacts_controller.rb

  def create
    @contact=Contact.new(contact_params) #creating new contact
    name=params[:contact][:Image].original_filename #will assign the name of the image to the variable name
   @contact.Image=name#assigning name to contact.image
    if @contact.save #for saving the contact fields in db
---
INSERT INTO "contacts" ("Address", "EmailId", "FirstName", "LastName", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["Address", ""], ["EmailId", ""], ["FirstName", "hngfgh"], ["LastName", ""], ["created_at", "2014-06-19 18:45:22.394157"], ["updated_at", "2014-06-19 18:45:22.394157"]]

  def show
    @contact=Contact.find(params[:id]) #finds by id and shows the contact
---
SELECT  "contacts".* FROM "contacts"  WHERE "contacts"."id" = ? LIMIT 1  [["id", 0]]

  def index
    @contacts=Contact.all #to display all the contacts
---
SELECT "contacts".* FROM "contacts"

  def edit
    @contact=Contact.find(params[:id])
---
SELECT  "contacts".* FROM "contacts"  WHERE "contacts"."id" = ? LIMIT 1  [["id", 2]]

  def update
  @contact=Contact.find(params[:id])
  name=params[:contact][:Image].original_filename#getting the original name
  @contact.Image=name
      if @contact.update(contact_params)
---
SELECT  "contacts".* FROM "contacts"  WHERE "contacts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "contacts" SET "Address" = ?, "MobileNumber" = ?, "updated_at" = ? WHERE "contacts"."id" = 4  [["Address", "23s, cit nagar\r\nusman road\r\nchennai\r\n\r\n"], ["MobileNumber", 9442272269], ["updated_at", "2014-06-20 03:05:30.716651"]]

  def destroy
    @contact=Contact.find(params[:id])
    @contact.destroy
---
SELECT  "contacts".* FROM "contacts"  WHERE "contacts"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 1]]